//HTTP request -  იუზერის მიერ იგზავნება მოთხოვნა გარკვეულ საკითხზე(მაგ წამოიღოს მონაცემი) სერვერთან 
//HTTP response  -  პასუხი სერვერის მხრიდან იუზერს

//200 - წარმატებით მიიღო სერვერმა მოთხოვნა
//400 - წარუმატებელი მოთხოვნა . ბექენდს არ მოეწონა იუზერის მიერ გაგზავნილი მოთხოვნა
//401 - არაავტორიზებული . ანუ იუზერი არ არის აუტორიზებული იმისთვის, რომ წვდომა ქონდეს მონაცემებთან
//404 - ვერ მოხერხდა იმ მონაცემის მოძიება რაც იყო მოთხოვნილი იუზერის მხრიდან
//500 - რაღაც არასწორად წავიდა . ანუ რაღაც შეფერხება მოხდა ბექენდში და მოთხოვნა ვერ შეასრულა ბექენდმა.

