//გამეორება
// array methods
//map - გადაუაროს,გადამაპოს სია და მათგან შექმნას ახალი სია
//filter - ვქმნით სიას და რაღც პირობის მიხედვითძველი სიიდან ახალში გადაგვაქვს ელემენტები
//find - ვეძებთ სასურველი პირობის მიხედვით ელემენტს და ვაბრუნებთ მას
//findIndex - ვეძებთ სასურველი პირობის მიხედვით ელემენტის ინდექსს და ვაბრუნებთ მას 
//concat - ორ სიას ვაერთიანებთ და ვიღებთ ახა ლსიას
//indexOf - ვიგებთ სიაში სასურველი ელემენტის ინდექსს
//slice - კონკრეტული ინდექსიდან კონკრეტულ ინდექსამდე ვწვდებით ელემენტებს
//splice - კონკრეტული ინდექსიდან , სასურველი ბიჯით , რა ელემენტამდეც მივალ , იქამდე ვშლით ელემენტებს
//reduce - პარამეტრად გადაეცემა ფუნქცია და მეორე პარამეტრის მნიშვნელობა უდრის ფუნქციაში არსებული პირველი პარამეტრის .(სიაში შეგვიძლია ჩავყაროთ პირობის მიხედვით  მოთხოვნილი ელემენტები , ერეიდან შეგვიძლია წავშალოთ დუპლიკატები და ერთ ცვლადში შეგვიძლია მოვაქციოთ რამდენიმე პირობის შედეგი)
////////////////////////////////////////////////////////////////////////////////////////////
//map - გადავუაროთ, გადავმაპოთ სია და ამ მეთოდის გამოყენებით შევქმნათ ახალი სია
const numbersArray = [1,5,9,3,6]

let newNumbersArray = numbersArray.map((item,index) => {
    // return item // ახალ ერეიში ჩაყრის  გადამაპული ერეის ელემენტებს
    return index // ახალ ერეიში ჩაყრის ელემენტების ინდექსებს
})

console.log(newNumbersArray)

//შევქმნატ საჭმელების სია, მეპის საშუალებით გადავუაროთ მასა და ახალ სიაში ჩავყაროთ საჭმელების ინდექსები
const foodsArray = ['xinkali','mwvadi','xathcahpuri','lobiani']

const newFoodsArray = foodsArray.map((item,index) => {
    return index
})

console.log(newFoodsArray)
////////////////////////////////////////////////////////////////////////////////////////////
//filter - სასურველი პირობის მიხედვით ვფილტრავთ სიას და ახლ სიაშ იგადაგვაქვს გაფილტრული ელემეტები ან მათი ინდექსები ( ეს აბტუნებს ან trueს ან falseს )

const oddsArray = [1,3,5,7,9,11,15,17]

const newOddsArray = oddsArray.filter((item,index) => {
    return item > 9 // ისეთი ელემენტები,რომლებიც მეტია 9 ზე , ჩავარდება ახალ სიაში 
   
})

console.log(newOddsArray)

//შექმენით რიცხვებით სავსე სია,filterისგამოყენბით კი 5-ის ჯერადები რიცხვები გადაიტანეთ ახალ სიაში

const otherNumbersArray = [1,3,5,10,15,20,25,50]

const resultArray = otherNumbersArray.filter((item,index) => {
    return item % 5 == 0
})

console.log(resultArray)
////////////////////////////////////////////////////////////////////////////////
// find - ვეძებთ სასურველი პირობის მოთხოვნით ელემენტს  და ვაბრუნებთ მას ( ელემენტს და არა სიას!)

const carsArray = ['bmw','mercedes','bugati']

let desiredElement = carsArray.find((item,index) => {
    return item == 'bugati' //თუ სიაში მოიძებნა მანქანა ბუგატი, დააბრუნებს მას
})

console.log(desiredElement)
////////////////////////////////////////////////////////////////////////////////////////
// concat - ვაერთიანებთ ორ სიას. ანუ ახალ სიაშ იიყრება უკვე შექმნილი ორი სიის ელემენტები

const arr1 = [1,2,3,4,5]
const arr2 = [6,7,8,9,10]
const arr3 = [11,12,13,14,15]
const arr4 = [16,17,18,19,20]
const mixedArray = arr1.concat(arr2,arr3,arr4) // იქმნება სია,სადაც მოთავსდება თითოეული ერეის ელემენტი
console.log(mixedArray)

///////////////////////////////////////////////////////////////
//indexOf  - აბრუნებს ინდექსს სასურველი ელემენტისას
const iceCreamArray = ['chocolate','straubery','banana','coffee']
console.log(iceCreamArray.indexOf('banana'))

/////////////////////////////////////////////////////////////////
// slice - კონკრეტული ელემენტის ინდექსიდან,კონკრეტული ელემენტის ინდექსამდე გვაქვს ქვდომა მათზე და ვაბრუნებთ მათ ერეიში

const dessertArray = [ 'chocolate','cake','iceCream','puncake','donat']
console.log(dessertArray.slice(1,4)) // პირველ ინდექსზე მდგომი ელემენტიდან, მეოთხე ინდექსზე მდგომ ელემენტა.მ.დ.ე დაიბეჭდება ელემენტები(ერეიში ჩაყრილი)
/////////////////////////////////////////////////////////////////////
//splice - კონკრეტული ინდექსიდან,სასრუველი რაოდენობის ბიჯით, ვშლით ელემენტებს და ვაბტუნებთ ახალ სიას მათ გარეშე
const numbers = [1,2,3,4,5,6,7,8,9,10]
const newNumbers = numbers.splice(1,4) // წაშლილი ელემენტებისგან შემდგარი სია
console.log(newNumbers)
console.log(numbers) //სიაში აღარ იქნებიან დასპლაიცებული ელემენტები